app/controllers/members_controller.rb

  def create
    binding.pry
    @member = Member.new(member_params)
    @house = House.find(params[:house_id])
    @member.house = @house
    if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Edmure"], ["last_name", "Tully"], ["house_id", 137], ["created_at", "2020-01-23 19:57:45.751231"], ["updated_at", "2020-01-23 19:57:45.751231"]]